import Modal from "../Modal";
import EcosystemModal from "../EcosystemModal";

interface PrivacyProps {
  privacy: any;
  setPrivacy: any;
  setAccountType: (arg: { open: boolean; id: number; name: string }) => void;
}

const Privacy: React.FC<PrivacyProps> = ({
  privacy,
  setPrivacy,
  setAccountType,
}) => {
  const handleClose = () => {
    setPrivacy({
      modal: false,
      privacy: "",
    });
    setAccountType({
      name: "donor",
      id: 1,
      open: true,
    });
  };
  return (
    <Modal setOpenModal={handleClose} openModal={privacy.modal}>
      <EcosystemModal
        onClose={handleClose}
        header={privacy.privacy}
        className='modal_back'>
        <div
          className='agreementTerms'
          style={{ fontFamily: "Montserrat Arm" }}>
          <p>
            Սույն Գաղտնիության քաղաքականությունը (այսուհետ՝ «Քաղաքականություն»)
            վերաբերում է բոլոր տեղեկություններին, որոնք կարող են տրամադրվել
            «301. Իմաստության երկիր» գիտակրթական հիմնադրամին (պետական գրանցման
            համար՝ 222.160.1172996, ՀՎՀՀ՝ 01309994, իրավաբանական հասցե՝ ՀՀ ,
            Երևւան , Մոսկովյան փ. 24) (այսուհետ՝ «Հիմնադրամ»)
            https://301land.com/ կայքէջից օգտվելիս (այսուհետ՝ «Կայք»), և
            բացատրում է, թե ինչպես է նման տեղեկատվությունն օգտագործվում
            Հիմնադրամի կողմից։
          </p>
          <p>
            ԵԶՐԵՐ ԵՎ ՍԱՀՄԱՆՈՒՄՆԵՐ
            <br />
            1.1. Սույն Քաղաքականության մեջ օգտագործվում են հետևյալ եզրերը՝
            <br />
            1.1.1. «cookie»՝ փոքր ֆայլեր, որոնք պարունակում են տեղեկատվություն
            Կայքի նախորդ այցելությունների մասին,
            <br />
            1.1.2. «անձնական տվյալներ»՝ ցանկացած տեղեկատվություն, որն
            ուղղակիորեն կամ անուղղակիորեն վերաբերում է կոնկրետ կամ ճանաչելի
            ֆիզիկական անձին (անձնական տվյալների սուբյեկտ), որը սույն
            Քաղաքականության շրջանակներում  հասկացվում է որպես՝
            <br />
            1) տվյալներ, որոնք ավտոմատ կերպով փոխանցվում են Կայքի էջեր այցելելու
            գործընթացում. &#8226; IP հասցեն, Կայք մուտք գործելու աղբյուրը և
            որոնման կամ գովազդի հարցումի մասին տեղեկությունները.
            <br />
            &#8226; օգտատիրոջ սարքի մասին տվյալներ (մասնավորապես՝ էկրանի
            լուծաչափը, կայքի բրաուզերի տարբերակը և օգտագործողի սարքը բնութագրող
            այլ հատկանիշներ),
            <br />
            &#8226; օգտատիրոջ կողմից իրականացված սեղմումներ, կայքէջի տարրերի վրա
            սեղմումներ, էջերի դիտումներ, դաշտերի լրացման վերաբերյալ փաստեր,
            բաններների և տեսանյութի դիտման մանրամասներ,
            <br />
            &#8226; այցելուներին բնութագրող տվյալներ,
            <br />
            &#8226; այցելության պարամետրեր,
            <br />
            &#8226; տվյալներ այցելության ժամանակի մասին,
            <br />
            &#8226; օգտատիրոջ նույնացուցիչներ, որոնք պահվում են cookie
            ֆայլերում:
            <br />
            2) տվյալներ, որոնք օգտատերը լրացնում է «301. Իմաստության երկիր»
            նախաձեռնությանը միանալու համար՝
            <br />
            &#8226; օգտատիրոջ անուն, ազգանունը,
            <br />
            &#8226; օգտատիրոջ էլեկտրոնային փոստի հասցեն,
            <br />
            &#8226; օգտատիրոջ հեռախոսահամարը,
            <br />
            &#8226; օգտատիրոջ բնակության երկիրը,
            <br />
            &#8226; օգտատիրոջ պաշտոնը և աշխատանքի վայրը.
            <br />
            &#8226; օգտատիրոջ ընկերների էլփոստի հասցեն (պարտադիր չէ):
            <br />
            1.1.3. «Անձնական տվյալների մշակում»՝ ցանկացած գործողություն կամ
            գործողությունների շարք, որոնք կատարվում են ավտոմատացման գործիքների
            միջոցով կամ առանց անձնական տվյալների հետ նման գործիքներ
            օգտագործելու, ներառյալ՝ առանց սահմանափակման, հավաքագրում, գրանցում,
            համակարգում, կուտակում, պահպանում, ճշգրտում (թարմացում,
            փոփոխություն), արդյունահանում, օգտագործում, փոխանցում (բաշխում,
            տրամադրում, մուտք), անձնական տվյալների ապանձնավորում, արգելափակում,
            ջնջում, ոչնչացում, ինչպես նաև ցանկացած այլ գործողությունների
            իրականացում Կայքի այցելուի անձնական տվյալների հետ՝  հաշվի առնելով
            գործող օրենսդրությունը,
            <br />
            1.1.4. «Անձնական տվյալների գաղտնիություն»՝ Հիմնադրամի համար պարտադիր
            պահանջ՝ կանխելու դրանց կանխամտածված տարածումը առանց անձնական
            տվյալների սուբյեկտի համաձայնության կամ այլ իրավական հիմքերի,
            <br />
            1.1.5. «Օգտատեր»՝ անձ, ով մուտք ունի Կայք համացանցի միջոցով և
            օգտագործում է Կայքը իր նպատակների համար,
            <br />
            1.1.6. «IP հասցե՝» համակարգչային ցանցի հանգույցի եզակի ցանցային
            հասցե, որը կառուցված է IP արձանագրության միջոցով:
          </p>
          <p>
            2. ԱՆՁՆԱԿԱՆ ՏՎՅԱԼՆԵՐԻ ՄՇԱԿՈՒՄԻ ՎԵՐԱԲԵՐՅԱԼ ՀԱՄԱՁԱՅՆՈՒԹՅՈՒՆ
            <br />
            2.1. Գործելով իր կամքով և սեփական շահերից ելնելով՜ Կայքից օգտվելիս
            օգտատերը Հիմնադրամին տրամադրում է իր համաձայնությունն իր անձնական
            տվյալների ավտոմատացված մշակման վերաբերյալ:
            <br />
            2.2. Անձնական տվյալների մշակման վերաբերյալ օգտատիրոջ
            համաձայնությունն ուժի մեջ է մտնում օգտատիրոջ՝ Կայք մուտք գործելու
            պահից և ուժի մեջ է մինչև այն հետ կանչելը: Օգտատիրոջ կողմից Կայքի
            օգտագործումը նշանակում է սույն Քաղաքականության և Օգտատիրոջ անձնական
            տվյալների մշակման պայմանների ընդունում:
            <br />
            2.3. Սույն համաձայնությունը կարող է հետ կանչվել՝ համապատասխան դիմում
            գրավոր ուղարկելով Հիմնադրամի հասցեին՝ անձնական տվյալների մշակումը
            դադարեցնելու խնդրանքով:
            <br />
            2.4. Քաղաքականության պայմանների հետ անհամաձայնության դեպքում
            Օգտատերը պետք է դադարեցնի կայքի օգտագործումը:
          </p>
          <p>
            3. ԱՆՁՆԱԿԱՆ ՏՎՅԱԼՆԵՐԻ ՄՇԱԿՈՒՄ
            <br />
            3.1. Հիմնադրամը կարող է մշակել Օգտատիրոջ անձնական տվյալները հետևյալ
            նպատակներով՝
            <br />
            ա) Օգտատիրոջ ինքնությունը հաստատելուց առաջ Կայքին տրամադրվող
            նյութերի վերաբերյալ համաձայնություն ձեռք բերելը,
            <br />
            բ) Օգտատիրոջ կողմից Հիմնադրամի հետ կնքած պայմանագրերից բխող
            պարտավորությունների կատարման ապահովումը,
            <br />
            գ) Օգտատիրոջ հետ իր տրամադրած տեղեկատվության վերաբերյալ կապ
            հաստատելը,
            <br />
            դ) Օգտատիրոջ նշումը որպես տրամադրված նյութերի հեղինակ կամ կազմող,
            <br />
            ե) Օգտատիրոջ հարցումների քննարկումը և Օգտատիրոջ հետ գործառնական
            հաղորդակցության հնարավորության ապահովումը,
            <br />
            զ) Օգտատիրոջը Կայքից օգտվելիս անհատականացված որոնման հնարավորության
            տրամադրումը,
            <br />
            է) Օգտատիրոջը տեղեկագրեր ուղարկելը, որոնց նա նախկինում
            բաժանորդագրվել է, և տեղեկացնել Հիմնադրամի գործունեության մասին,
            <br />
            ը) Կայքի օգտատերերի նախասիրությունները որոշելը, անհատականացնելը և
            Կայքի օգտագործելիությունը բարելավել:
            <br />
            3.2. Հիմնադրամը չի մշակի Օգտատիրոջ կողմից տրամադրված անձնական
            տվյալները այլ նպատակներով, բացի վերը նշվածից կամ օրենքով
            նախատեսվածներից:
            <br />
            3.3. Հիմնադրամը կպահի Օգտատիրոջ կողմից տրամադրված անձնական տվյալները
            այնպիսի ժամկետով, որն անհրաժեշտ է դրանց տրամադրման նպատակներին
            հասնելու համար:
            <br />
            3.4. Cookie-ները օգտագործվում են Կայքի օգտատերերի նախասիրությունները
            որոշելու, Կայքից օգտվելու հարմարությունը անհատականացնելու և
            բարելավելու համար: Եթե Օգտատերը չի ցանկանում օգտագործել cookie-ներ,
            նա պետք է փոխի իր բրաուզերի կարգավորումները: Օգտատիրոջը զգուշացվում
            է, որ cookie-ներն անջատելը կարող է հանգեցնել Կայք մուտք գործելու
            անհնարինության:
            <br />
            3.5. Անձնական տվյալների մշակումը տեղի է ունենում Google Analytics և
            Yandex.Metrica մասնագիտացված վեբ հավելվածների միջոցով՝ համաձայն
            կանոնների, որոնց հղումները տրված են ստորև: Սույնով Դուք նաև
            տրամադրում եք Ձեր համաձայնությունը վերոնշյալ անձնական տվյալների
            փոխանցմանը Google LLC (115035, Մոսկվա, Բալչուգ փող. 7) և YANDEX LLC
            (119034, Մոսկվա, Լև Տոլստոյի փող. 16) ընկերություններին:
            <br />
            Google Analytics-ի անձնական տվյալների մշակման կանոններ
            (https://policies.google.com/privacy?hl=en)
            <br />
            Yandex.Metrica ծառայության անձնական տվյալների մշակման կանոններ
            (https://metrica.yandex.com/about/info/privacy-policy)
            <br />
            3.6. Հիմնադրամը պարտավորվում է հարգել Կայքի Օգտատերերի կողմից
            տրամադրված անձնական տվյալների գաղտնիությունը՝ հաշվի առնելով գործող
            օրենսդրությունը:
            <br />
            3.7. Օգտատիրոջ անձնական տվյալները կարող են փոխանցվել լիազորված
            պետական մարմիններին միայն գործող օրենսդրությամբ սահմանված հիմքերով և
            կարգով:
          </p>
          <p>
            4. ՕԳՏԱՏԵՐԵՐԻ՝ ՈՐՊԵՍ ԱՆՁՆԱԿԱՆ ՏՎՅԱԼՆԵՐԻ ՍՈՒԲՅԵԿՏԻ ԻՐԱՎՈՒՆՔՆԵՐԸ
            <br />
            4.1. Անձնական տվյալներ Հիմնադրամ փոխանցելիս կամ Հիմնադրամի կողմից
            մշակվելիս Կայքի Օգտատերը, լինելով անձնական տվյալների սուբյեկտ, ունի
            հետևյալ իրավունքները՝
          </p>
          <p>
            &#8226; մուտքի իրավունք՝ Կայքի Օգտատերն իրավունք ունի Հիմնադրամից
            պահանջել իր մասին Հիմնադրամին հասանելի տեղեկատվության պատճենը,
            <br />
            &#8226; ուղղումներ կատարելու իրավունք՝ Կայքի Օգտատերն իրավունք ունի
            ուղղել իր մասին ոչ ճշգրիտ կամ թերի տվյալները, որոնք պահվում են
            Հիմնադրամի կողմից,
            <br />
            &#8226; մշակումը սահմանափակելու իրավունք՝ Կայքի Օգտատերը որոշակի
            պայմանների առկայության դեպքում իրավունք ունի սահմանափակել
            Հիմնադրամին տրամադրվող անձնական տվյալների մշակումը,
            <br />
            &#8226; փոխանցման իրավունք՝ Կայքի Օգտատերն իրավունք ունի պահանջելու
            Հիմնադրամին տրամադրված անձնական տվյալների փոխանցումը այլ
            կազմակերպության,
            <br />
            &#8226; Առարկելու իրավունք՝ Կայքի օգտատերն իրավունք ունի
            չհամաձայնվել անձնական տվյալների մշակման որոշակի մեթոդների հետ և
            (կամ) պահանջել դադարեցնել և (կամ) սահմանափակել իր անձնական տվյալների
            մշակումը:
            <br />
            4.2. Վերոնշյալ իրավունքներից օգտվելու համար Կայքի Օգտատերը պետք է
            կապ հաստատի Հիմնադրամի հետ՝ օգտագործելով «Կոնտակտային տվյալներ»
            բաժնում նշված կոնտակտային տվյալները: Եթե ​​Հիմնադրամը մերժում է
            Օգտատիրոջը տրամադրված անձնական տվյալների մուտքի իրավունքը,
            Հիմնադրամը պարտավորվում է Օգտատիրոջը տրամադրել պատճառաբանված
            մերժում:
            <br />
            4.3. Եթե Օգտատերը համաձայն չէ Հիմնադրամի՝ անձնական տվյալների
            հասանելիություն տրամադրելու մերժման հետ, Կայքի Օգտատերն իրավունք
            ունի բողոք ներկայացնել Հիմնադրամին՝ Կայքի «Բողոքներ» բաժնում նշված
            կարգով:
          </p>
          <p>
            5. ԱՆՎՏԱՆԳՈՒԹՅՈՒՆ ԵՎ ՊԱՏԱՍԽԱՆԱՏՎՈՒԹՅՈՒՆ
            <br />
            5.1. Անձնական տվյալները մշակելիս Հիմնադրամը ձեռնարկում է անհրաժեշտ
            իրավական, կազմակերպչական և տեխնիկական միջոցներ՝ անձնական տվյալները
            դրանց չթույլատրված կամ պատահական հասանելիությունից, ինչպես նաև
            երրորդ անձանց այլ անօրինական գործողություններից պաշտպանելու համար:
            <br />
            5.2. Հիմնադրամը պատասխանատու է Օգտատիրոջ անձնական տվյալների
            կանխամտածված բացահայտման համար՝ համաձայն գործող օրենսդրության՝
            բացառությամբ Սույն Քաղաքականության 3.6 և 4.2 կետերում նախատեսված
            դեպքերի: 
            <br />
            5.3. Անձնական տվյալների կորստի կամ բացահայտման դեպքում Հիմնադրամը
            պատասխանատվություն չի կրում, եթե այս տեղեկատվությունը՝
            <br />
            5.3.1. եղել է հանրային տիրույթում նախքան այն կորցնելը կամ
            բացահայտվելը, 
            <br />
            5.3.2. ձեռք է բերվել է Հիմնադրամից անկախ երրորդ անձանց կողմից,
            <br />
            5.3.3. ձեռք է բերվել երրորդ անձանց կողմից Կայքի ֆայլերին չարտոնված
            մուտքի միջոցով,
            <br />
            5.3.4. բացահայտվել է Օգտատիրոջ համաձայնությամբ:
            <br />
            5.4. Օգտատերը պատասխանատվություն է կրում գործող օրենսդրությանը
            համապատասխան տրամադրված անձնական տվյալների օրինականության, ճշտության
            և ճշմարտացիության համար:
          </p>
          <p>
            6. ԵԶՐԱՓԱԿԻՉ ԴՐՈՒՅԹՆԵՐ
            <br />
            6.1. Սույն Քաղաքականությունը վերաբերում է միայն սույն Կայքին:
            Հիմնադրամը չի վերահսկում և պատասխանատվություն չի կրում երրորդ կողմի
            կայքերի համար, որոնց Օգտատերը կարող է անցնել սույն Կայքում առկա
            հղումների միջոցով:
            <br />
            6.2. Սույն Քաղաքականությունը ղեկավարվում է Հայաստանի Հանրապետության
            օրենքներով:
            <br />
            6.3. Հիմնադրամն իրավունք ունի փոփոխություններ կատարել սույն
            Քաղաքականության մեջ՝ առանց Օգտատիրոջ համաձայնության:
            <br />
            6.4. Նոր քաղաքականությունն ուժի մեջ է մտնում Կայքում տեղադրվելու
            պահից, եթե այլ բան նախատեսված չէ Քաղաքականության նոր տարբերակով:
            <br />
            6.5. Օգտատերը կարող է պարզաբանումներ ստանալ իր անձնական տվյալների
            մշակման վերաբերյալ՝ ուղարկելով համապատասխան գրավոր կամ էլեկտրոնային
            հարցում «Կոնտակտային տվյալներ» բաժնում նշված կոնտակտային տվյալներին։
          </p>
        </div>
      </EcosystemModal>
    </Modal>
  );
};

export default Privacy;
